class Vacancy {
  const Vacancy({
    required this.id,
    required this.title,
    required this.description,
  });

  final String id;
  final String title;
  final String description;
}

class Vacancies {
  static const List<Vacancy> all = [
    Vacancy(
      id: 'parner',
      title: 'Партнёрская программа',
      description: '...',
    ),
    Vacancy(
      id: 'dart',
      title: 'Flutter/Dart Developer',
      description: '''Обязанности:

- разработка, тестирование и поддержка проекта на Flutter.


Требования:

- понимание принципов UX дизайна для мобильных устройств;
- знание GraphQL и понимание как использовать его через WebSocket;
- понимание принципов работы WebRTC (желательно);
- трепетное отношение к коду и умение качественно его документировать;
- понимание необходимости автоматического тестирования и опыт его применения;
- умение читать и понимать техническую литературу на английском языке;
- наличие широкого Интернет-канала и настроенной программы Skype, позволяющих поддерживать качественную видеосвязь.


Условия:

- полная занятость;
- начальная ставка заработной платы от 2000 EUR в месяц;
- ежедневное зачисление заработной платы;
- удалённое сотрудничество;
- предусмотрен учёт рабочего времени;
- рабочее время: с 11:30 по 13:00 UTC находиться онлайн обязательно, остальное время выбирается самостоятельно по согласованию с тимлидом.


Дополнительно:

- оказывается помощь при переезде в одну из штаб-квартир компании.''',
    ),
    Vacancy(
      id: 'rust',
      title: 'Rust Developer',
      description: '''Обязанности:

- проектирование, разработка, тестирование и поддержка бэкендов веб-проектов;
- разработка высокопроизводительных низкоуровневых элементов ПО;
- проектирование структур баз данных;
- разработка модулей к существующим проектам.


Требования:

- опыт использования и понимание языка Rust;
- приветствуется опыт работы с языками C, C++;
- понимание FFI и UB;
- опыт оптимизации программ и умение использовать профилировщик;
- понимание принципов работы клиент-серверных web-приложений;
- опыт и понимание принципов проектирования структур баз данных;
- понимание принципов DDD и слоенной архитектуры;
- опыт написания модульных и функциональных тестов;
- опыт работы с Git;
- умение использовать операционные системы типа *nix;
- приветствуется опыт работы по CQRS+ES парадигме;
- приветствуется опыт работы с технологиями Memcached, Redis, RabbitMQ, MongoDB, Cassandra, Kafka;
- приветствуется опыт работы с другими языками Java, Go, Python, Ruby, TypeScript, JavaScript;


Условия:

- полная занятость;
- начальная ставка заработной платы от 2000 EUR в месяц;
- ежедневное зачисление заработной платы;
- удалённое сотрудничество;
- предусмотрен учёт рабочего времени;
- рабочее время: с 11:30 по 13:00 UTC находиться онлайн обязательно, остальное время выбирается самостоятельно по согласованию с тимлидом.


Дополнительно:

- оказывается помощь при переезде в одну из штаб-квартир компании.''',
    ),
    Vacancy(
      id: 'ui',
      title: 'UI/UX Designer',
      description: '''Обязанности:
- разработка дизайна приложения на Flutter;


Требования:
- понимание принципов работы приложений с точки зрения эстетики и юзабилити.
- навык написания анимированных элементов


Условия:

- полная занятость;
- начальная ставка заработной платы от 1000 EUR в месяц;
- ежедневное зачисление заработной платы;
- удалённое сотрудничество;
- предусмотрен учёт рабочего времени;
- рабочее время: с 14:00 по 16:00 UTC находиться онлайн обязательно, остальное время выбирается самостоятельно по согласованию с тимлидом.


Дополнительно:

- оказывается помощь при переезде в одну из штаб-квартир компании.''',
    ),
    if (false)
      Vacancy(
        id: 'ai',
        title: 'AI Specialist',
        description: '''Обязанности:

- генерить задачи (запросы) для нейросетей;
- отслеживать тренды в использовании нейросетей;
- тренировка существующих нейросетей для решения определенных задач;
- поиск и реализация лучших вариантов решения поставленных задач.


Требования:

- опыт работы с нейросетями как для работы с текстом, так и для генерации изображений;
- опыт prompt инжиниринга и понимание того, как составить запрос, чтобы получить нужный результат;
- практический опыт генерации и тренировки нейросетей, а также понимание их особенностей;
- знание Python либо любой другой среды, позволяющей работать с нейросетями;
- приветствуется опыт работы с нейросетями типа: StableDiffusion, GAN, GPT, DALL·E
- желание активно развиваться и изучать новое;
- умение читать и понимать техническую литературу на английском языке;
- наличие широкого Интернет-канала и настроенной программы Skype, позволяющих поддерживать качественную видеосвязь.


Условия:

- полная занятость;
- начальная ставка заработной платы от 1000 EUR в месяц;
- ежедневное зачисление заработной платы;
- удалённое сотрудничество;
- предусмотрен учёт рабочего времени;
- рабочее время выбирается самостоятельно по согласованию с тимлидом.


Дополнительно:

- оказывается помощь при переезде в одну из штаб-квартир компании.''',
      ),
  ];
}
